Tekla Open API Reference for Tekla Structures 2025
Distance.ToFractionalFeetAndInchesString Method
Overload List
Name | Description
ToFractionalFeetAndInchesString()
 Creates a string representation of the distance in feet and inches.
ToFractionalFeetAndInchesString(IFormatProvider)
 Creates a string representation of the distance in feet and inches.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace